Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Download Hero Wars, the epic mobile fantasy RPG, and play in the company of hero legends!
pt_pt: Transfere Hero Wars, o RPG épico de fantasia para dispositivos móveis e joga na companhia de heróis lendários!

source: The Summer Nightmare is here, along with some new looks!
pt_pt: O Pesadelo de Verão trouxe estilos novos!

source: New Lunar Skins!
pt_pt: Novos visuais Lunares!

source: Spring is full of life! Spring Sale A great big bouquet of sales and discounts awaits you! Jhu’s Special Shop Visit it to purchase the hero himself and a ton of valuable items. Jhu Buff The “The Spirits Will Heal Me” skill now restores much more health, while the “I See You” skill triggers quicker and lasts longer. Show the Dominion that you can’t be stopped!
pt_pt: A primavera é sinónimo de vida! Promoção de Primavera Há um bouquet de descontos à tua espera! Loja Especial do Jhu Visita-a para comprar tanto o herói como um monte de itens valiosos. Efeito do Jhu A habilidade “Os Espíritos Vão Curar-me” restaura muita mais vida. A habilidade “Estou a Ver-te” é ativada mais depressa e dura mais tempo. Mostra ao Domínio que és imparável!

source: The game is mainly automatic indeed, but sometimes the player's actions can really make a difference.
pt_pt: O jogo é de facto maioritariamente automático, mas ocasionalmente as ações do jogador podem realmente fazer a diferença.

source: It's about the proper timing of using skills, as well as about matching best combinations of heroes, depending on your enemy.
pt_pt: O segredo é usar habilidades no momento certo, assim como escolher a melhor combinação de heróis para derrotar um determinado inimigo.

source: Monsters and traps await brave heroes.
pt_pt: Monstros e armadilhas aguardam por bravos heróis.

source: Most noble will be rewarded
pt_pt: Os mais nobres serão premiados

source: In this puzzle, you need to tap on the mushrooms repeating the sequence in which the lights above them light up :)
pt_pt: Neste quebra-cabeças, tens de tocar nos cogumelos quando a luz por cima deles acende :)

source: Meet Keros!
pt_pt: Conhece Keros!

source: • Fight bosses, earn Holiday Coins, and spend them at the Holiday Shop.
pt_pt: • Enfrenta bosses, ganha Moedas de Feriado e usa-as na Loja de Feriado.

source: Test all the Titans, including the newcomer, Iyari, in battle to find the best winning strategies and get cool rewards!
pt_pt: Testa os Titãs, incluindo o mais recente, Iyari, em combate para descobrir estratégias para ganhar e obter recompensas!

source: Winter has come to Dominion! Hero Changes The newest hero is Amira the Djinn. Satori has become stronger, he now applies more Fox Fire marks! Satori, Martha, Celeste, Ziri, Rufus, and the new hero Amira get a new trait, Mystic. Hurry up and try them out in battle! Wintry Wonders New Year Event Learn about the magical adventures of Amira, Satori, and many other heroes! Winter Skins Some heroes have warmed themselves up against Dominion’s cold. Find out who!
pt_pt: O inverno chegou ao Domínio! Mudanças nos heróis Amira a Djinn é a grande novidade. Satori tornou-se mais forte, podendo aplicar mais marcas de Fogo Vulpino! Satori, Martha, Celeste, Ziri, Rufus e a nova chegada, Amira, recebem uma nova caraterística: Místico. Despacha-te, experimenta-os já nos combates! Evento de Ano Novo Maravilhas de Inverno Conhece as aventuras mágicas de Amira, Satori e mais! Visuais invernais Alguns heróis preparam-se bem contra o frio do Domínio, descobre quais!

source: Hero Wars is compatible with the following devices: iPhone SE, 6S, 7, 8, X, XS, XR; iPad Mini 4, Air 2, 2017, 2018, Pro
pt_pt: O Hero Wars é compatível com os seguintes dispositivos: iPhone SE, 6S, 7, 8, X, XS, XR; iPad Mini 4, Air 2, 2017, 2018, Pro

source: Welcome Solaris to the Dominion! Join this event to test the new Super Titan in Brawls and get her on your team!
pt_pt: Solaris chega ao Domínio! Participa no evento! Testa a nova Supertitã em combate e adiciona-a à tua equipa!

source: New Talismans for your favorite Heroes are here!
pt_pt: Há novos talismãs para os teus Heróis favoritos!

source: Claim daily rewards to obtain Xe'Sha and power her up.
pt_pt: Resgata recompensas diárias para obter Xe'Sha e reforçá-la.

source: Strengthen your team with the magic of distant worlds!
pt_pt: Fortalece a tua equipa com a magia de mundos distantes!

source: The Dominion Day is here!
pt_pt: É Dia do Domínio!

source: Celebrate it together with your favorite Guardians and help them restore the Holiday Cake!
pt_pt: Vem celebrá-lo com os teus Guardiões favoritos e ajuda-os a restaurar o Bolo Festivo!

source: The gate will be unlocked in one of the future updates Stay tuned!
pt_pt: O portão será desbloqueado numa das atualizações futuras Mantém-te a par!

source: You can’t disconnect the account you are logged into
pt_pt: Não podes sair da conta à qual estás ligado(a)

source: Are you ready for a Major War?
pt_pt: Estás a postos para uma Grande Guerra?

source: GET READY TO FIGHT!
pt_pt: PREPARA-TE PARA LUTAR!

source: Ride the wave of style as a real sea-dog!
pt_pt: Surfa a onda do estilo como um verdadeiro marinheiro!

source: Isaac’s outfit can also be additionally upgraded — make him even stronger!
pt_pt: O fato de Isaac pode ser melhorado, tornando-o ainda mais forte!

source: Forgot password?
pt_pt: Esqueceste-te da tua palavra-passe?

source: This month, you’ll be able to increase Ishmael’s power!
pt_pt: Este mês vais poder aumentar o poder de Ishmael!

source: This crafty fighter’s entire life is dedicated to combat, both against the enemies of Dominion and the darkness inside himself!
pt_pt: Este guerreiro astuto dedicou a vida ao combate, tanto contra os inimigos do Domínio como contra a sua própria escuridão interior!

source: Help him attain victory!
pt_pt: Ajuda-o a vencer!

source: Play daily, collect Ishmael Soul Stones, and make him even stronger!
pt_pt: Joga todos os dias, obtém Pedras Anímicas para Ishmael e vê-o ficar mais poderoso!

source: Fall Celebrations
pt_pt: Celebra o Outono

source: Thank you for your feedback! We have taken some creative liberty in presenting the game in advertisements to appeal to a wider audience, even those who have previously not played any RPG games. Nevertheless, we will continue to improve our game and advertisements based on your feedback — you can already check our Tower gameplay in Hero Wars!
pt_pt: Obrigado pela tua avaliação! Tentámos ser criativos ao apresentar e anunciar o jogo de forma a agradar a uma audiência mais ampla, incluindo quem nunca jogou jogos RPG. No entanto, continuaremos a melhorar o jogo e os anúncios com base nas críticas. Aliás, já podes experimentar o modo Torre no Hero Wars!

source: Have fun, Brave Hero!
pt_pt: Diverte-te, herói!

source: For easier access to your account, link it to your social media profile
pt_pt: Para um acesso mais fácil à tua conta, associa-a ao teu perfil nas redes sociais

source: Don’t miss this chance to grant even greater might to the patron of the elven city of Riversar! Enter the game every day during the whole month and collect Soul Stones for Aurora, that her crystal sword might gleam with heavenly light and her iridescent halo might mercilessly burn her foes to ash!
pt_pt: Não percas a oportunidade de dar ainda mais poder à defensora de RIversar, a cidade élfica! Joga todos os dias em setembro e obtém pedras anímicas para Aurora! Que a espada dela brilhe com luz celestial e reduza os seus inimigos a cinzas!

source: BATTLE IN PVP MODES
pt_pt: LUTA NOS MODOS PvP

source: HUNT TO SURVIVE!
pt_pt: CAÇA E SOBREVIVE!

source: The battle arena is the perfect place to show your strength: clash with epic bosses in the war against the Archdemon and his followers, or play strategic minigames.
pt_pt: A arena de batalha é o lugar ideal para mostrar a tua força: luta contra bosses épicos na guerra contra o Grão-Demónio e os seus seguidores ou então joga mini-jogos estratégicos.

source: In the City Gates minigame, make your way up a tower with a single hero, fighting enemies and solving math puzzles along the way.
pt_pt: No mini-jogo City Gates, tenta chegar a uma torre com um único herói, enquanto lutas contra inimigos e resolves puzzles de matemática.

source: In our ads, we aim to capture the spirit of our game in a flashy and concise manner.
pt_pt: Os nossos anúncios são uma forma atrativa e concisa onde tentamos capturar o espírito do jogo.

source: We are constantly improving and updating our game mechanics, so you can already try the Tower gameplay in Hero Wars, which will reward you with Gold, Energy and even Heroes!
pt_pt: Procuramos melhorar e atualizar regularmente a jogabilidade, por isso já podes experimentar o modo Torre no Hero Wars e ganhar Ouro, Energia e até Heróis!

source: Hope you'll stick around to see if our game is worth your attention.
pt_pt: Esperamos que fiques por perto para ver se o nosso jogo merece a tua atenção.

source: This three-day event offers new skins and thematic bundles!
pt_pt: Este evento de três dias oferece novos visuais e conjuntos temáticos!

source: Resources for Tenebris, a Celestial skin for Aidan, a summer frame and avatar — both June Passes are full of rewards!
pt_pt: Recursos para Tenebris, visual Celestial para Aidan e uma moldura e avatar de verão. Os Passes de Junho têm recompensas!

source: The fluffy defender of the Dominion is here!
pt_pt: Chegou o guardião mais fofo do Domínio!

source: Meow!
pt_pt: Miau!

source: if you already have an account
pt_pt: se já tiveres uma conta

source: Become a Hero
pt_pt: Sê um Herói

source: Break through a tide of enemies and terrifying bosses in the new event to learn the story of Tempus, the Lord of Time!
pt_pt: Abre caminho por vagas de inimigos e bosses no novo evento e descobre a história de Tempus, o Senhor do tempo!

source: Become a legend
pt_pt: Torna-te uma lenda

source: Sign up to save your progress
pt_pt: Regista-te para guardares o teu progresso

source: Loading...
pt_pt: A carregar...

source: A great chance to level up your Chaos Heroes!
pt_pt: Melhora os teus Heróis do Caos!

source: REMOVE 1 COW TO LET HIM OUT
pt_pt: REMOVE 1 VACA PARA O DEIXAR ESCAPAR

source: Earn every trophy in the new Battle Pass!
pt_pt: Ganha todos os troféus do novo Passe de Batalha!

source: ● Puzzles with rewards
pt_pt: ● Puzzles com recompensas

source: Russian Ruble
pt_pt: Rublo russo

source: Celestial Skins for Kayla and Octavia!
pt_pt: Visuais Celestiais para Kayla e Octavia!

source: Unlock three new Romantic Skins, try out the improved Luther, and don’t miss out on loads of unique offers!
pt_pt: Desbloqueia 3 visuais românticos, experimenta o Luther melhorado e não percas toneladas de ofertas exclusivas!

source: The Dominion Day in Hero Wars!
pt_pt: É Dia do Domínio no Hero Wars!

source: Incorrect e-mail
pt_pt: E-mail incorreto

source: Register or Log in
pt_pt: Regista-te ou Inicia sessão

source: These refined new outfits will make your favorite Heroes look like they've leapt up from the pages of antique legends! The special event shop carries an assortment of goods, from Greek Skins to the event chest, Hero items, and valuable resources—all at a great price! You can also purchase an extra outfit upgrade for Cascade during the 3-day sale. After that, just crown him with a victor's laurels, and you'll be able to take on the world!
pt_pt: Estes elegantes fatos farão com que os teus Heróis pareçam ter saído diretamente das páginas de antigas lendas! A loja especial do evento tem vários itens, desde Visuais Gregos ao cofre do evento, itens de Heróis e recursos valiosos — tudo a um preço excelente! Também podes comprar uma melhoria adicional para o fato de Cascade durante a promoção de 3 dias. Depois, é só aguardar a vitória!

source: Claim daily rewards to make the brave necromancer princess part of your team and upgrade her!
pt_pt: Obtém recompensas diárias, melhora a princesa necromante e usa-a na tua equipa!

source: A famous explorer, Lady Lara Croft, has taken up residence in one of the Dominion's most luxurious mansions. It's time for her to meet the Guardians; if not them, who will uncover all the mysteries of Dominion with her? Take part in the event to unlock Lara Croft and her lineup of Skins! The adventure won't be an easy one, so make sure to take along some Artifacts, Soul Stones, and a special Talisman to make Lara stronger and help her reach the truth!
pt_pt: A famosa exploradora Lara Croft instalou-se numa das mansões mais luxuosas do Domínio. Está na altura de ela conhecer os Guardiões; se não forem eles, quem a irá ajudar a desvendar os mistérios do Domínio? Participa no evento para desbloquear Lara Croft e os seus Visuais! A aventura não será fácil, por isso, certifica-te de que levas Artefactos, Pedras Anímicas e um Talismã especial para tornar Lara mais forte. Ajuda-a a descobrir a verdade!

source: So, the main goal is to draw your attention to the game so that you could check it out yourself — for example, our new Tower gameplay that grants awesome rewards.
pt_pt: Por isso, o principal objetivo é captar a tua atenção para que tires as tuas conclusões, por exemplo, ao jogar o novo modo Torre que te dá recompensas fantásticas.

source: CHOOSE THE NEXT LEVEL!
pt_pt: ESCOLHE O NÍVEL SEGUINTE!

source: “Allow”
pt_pt: "Permitir"

source: Added stun, knock-up, and curse marks to skill description
pt_pt: Foram adicionadas marcas de atordoamento, projeção e maldição à descrição de habilidades.

source: Adventures in the Nightmare Valley welcome you!
pt_pt: Bem-vindo às aventuras no Vale do Pesadelo!

source: Join the scary fun!
pt_pt: Junta-te à diversão assustadora!

source: Power up your Heroes & get a Skin+ for Sebastian!
pt_pt: Melhora heróis e ganha um Visual+ para Sebastian!

source: Complete event quests and obtain Talismans for six Heroes!
pt_pt: Conclui missões de eventos e obtém Talismãs para seis Heróis!

source: Behold the Force of Progress!
pt_pt: Vê bem a Força do progresso!

source: - Meet the new and improved Daredevil!
pt_pt: - Conhece a nova Daredevil!

source: Improved skills, explosive damage, and mind-blowing fun are waiting for you!
pt_pt: Habilidades melhoradas, dano explosivo e diversão sem limites esperam por ti!

source: It's time for transformations!
pt_pt: Está na altura de transformações!

source: Shrouded in Mystery Your favorite Heroes look so different!
pt_pt: Envolto em Mistério Os teus Heróis preferidos estão tão diferentes!

source: Astrid, Lucas, Iris, and Heidi are dressed to impress in their Masquerade outfits!
pt_pt: Astrid, Lucas, Iris e Heidi estão impressionantes com os seus visuais Mascarados!

source: Complete event quests and take Astrid's and Lucas's festival looks to the next level.
pt_pt: Conclui missões do evento e leva os visuais de festival de Astrid e Lucas ao próximo nível.

source: What could be cuter than a dressed-up pet?
pt_pt: Não há nada mais giro que um animal de estimação bem vestido.

source: A Star is Reborn With her newfound powers, Dark Star is ready to take on any foes!
pt_pt: Uma Estrela Renasce Com os seus novos poderes, a Estrela Sombria está pronta para enfrentar os inimigos!

source: Test your team's new limits!
pt_pt: Põe à prova os novos limites da tua equipa!

source: Dominion Awaits
pt_pt: Domínio aguarda

source: Evolution Booster: Star Up Your Heroes
pt_pt: Reforço de evolução: ganha mais estrelas

source: Hurry up to participate in the event, complete fun quests, and obtain Talismans, along with resources to upgrade them! These powerful artifacts are available for six Heroes: Elmir, Jorgen, Judge, Lian, Martha, and Tristan. Don't miss a unique chance to power up your team!
pt_pt: Não percas esta oportunidade única de melhorar os teus heróis! Participa no evento, conclui missões divertidas e ganha Talismãs e recursos para os melhorar! Estes poderosos artefactos estão disponíveis para seis heróis: Elmir, Jorgen, Judge, Lian, Martha e Tristan.

source: You're logged in with
pt_pt: Tens sessão iniciada com

source: To Darkness’s delight, the unmatched Tenebris will share her power with her Titan allies and curse her enemies with a single touch!
pt_pt: Para deleite das Trevas, Tenebris está pronta a partilhar o seu poder com os aliados dela, assim como a amaldiçoar os seus inimigos com um toque!

source: Experience this new Super Titan’s cruel skills in brawls!
pt_pt: Testa as habilidades desta nova Supertitã nas Brigas!

source: Unite the Dark Titans under Tenebris’ powerful lead and earn as many upgrade resources for her as you can!
pt_pt: Lidera os Titãs das Trevas e ganha imensos recursos para melhorias!

source: Strengthen your team with the new Dark Titan!
pt_pt: Fortalece a tua equipa com o novo Titã das Trevas!

source: ROB HIM
pt_pt: ROUBA-O

source: • New Hero: Sebastian, a bard of legend, is there for his allies in a time of desperate need.
pt_pt: • Novo herói: Sebastian, um lendário bardo que irá ajudar os aliados quando mais precisarem.

source: The Hero Wars Team
pt_pt: A equipa de Hero Wars

source: Epic Update! The Cross-Server Guild Tournament is coming!
pt_pt: Atualização épica! O Torneio de Guildas entre Servidores!

source: Complete the Campaign missions to earn special Keys!
pt_pt: Completa as missões da campanha e ganha chaves especiais!

source: Use those to open the Artifact Boxes and win awesome rewards!
pt_pt: Usa-as para abrir Caixas de Artefactos e ganhar recompensas fantásticas!

source: There was an error with your email/password combination.
pt_pt: Ocorreu um erro com a tua combinação de e-mail/palavra-passe.

source: Please try again, or reset your password
pt_pt: Tenta novamente ou repõe a tua palavra-passe.

source: The Power of Darkness!
pt_pt: O Poder da Escuridão!

source: Log in every day this November to upgrade the princess of the Eternity faction!
pt_pt: Em novembro, entra no jogo diariamente e melhora a fação da princesa!

source: It’s time to really bump up the power of your class runes!
pt_pt: Está na hora de aumentar o poder das tuas runas de classe!

source: Beauty in Bloom!
pt_pt: Beleza a desabrochar!

source: Done!
pt_pt: Feito!

source: Old password
pt_pt: Palavra-passe antiga

source: This Month’s Hero is Ishmael!
pt_pt: O herói do mês é Ishmael!

source: Thank you very much for the kind words!
pt_pt: Muito obrigado pelas palavras simpáticas!

source: We are glad to hear you love Island Questaway!
pt_pt: É um prazer saber que adoras o Island Questaway!

source: Such positive feedback inspires our team to do our best to keep Island Questaway the way you like it and make it even better.
pt_pt: Estes comentários positivos inspiram a nossa equipa a dar o seu melhor para manter o Island Questaway a funcionar como mais gostas, e até para melhorá-lo.

source: See you on the next adventure!
pt_pt: Vemo-nos na próxima aventura!

source: Astral Season
pt_pt: Temporada Astral

source: You can do so by following this link: bit.ly/IQ_support Thank you in advance!
pt_pt: Podes fazer isso através desta ligação: bit.ly/IQ_support Agradecemos desde já!

source: Hurry up to power up Isaac!
pt_pt: Melhora Isaac!

source: This Month's Hero is Araсhne
pt_pt: Arachne é a Heroína deste mês!

source: GET TREASURES!
pt_pt: DESCOBRE TESOUROS!

source: New outfits and Skin+ for Fafnir are in the Dominion!
pt_pt: Há novos visuais e Visuais+ para Fafnir no Domínio

source: Help Cascade, Oya, and Celeste dress to impress!
pt_pt: Ajuda Cascade, Oya e Celeste a ficarem incríveis!

source: It’s great that you’ve given our game a try!
pt_pt: Que bom que experimentaste o nosso jogo!

source: We understand your concern about our ad, but we hope it won’t affect your experience once you’ve given our game a chance.
pt_pt: Compreendemos a tua preocupação com o nosso anúncio, mas esperamos que não afete a tua experiência assim que experimentares o jogo.

source: We’re constantly working on improving our game mechanics, and you can already dive into the Tower game at the City Gate.
pt_pt: Procuramos melhorar e atualizar regularmente a jogabilidade e já podes experimentar o modo Torre no Portão da Cidade.

source: It offers rewards like Gold, Energy, and even Heroes!
pt_pt: Oferece recompensas como Ouro, Energia e até Heróis!

source: Let’s greet fall together!
pt_pt: Dá as boas-vindas ao outono!

source: Autumn Festival Gulp down a mug of Dominion Brew, celebrate with your friends, and enjoy an autumn full of surprises!
pt_pt: Festival de Outono Bota abaixo uma caneca de Bebida do Domínio, celebra com os amigos e desfruta de um outono cheio de surpresas!

source: The Outland VIP level 7+ players that defeat the Master of the Outland can open Outland Chests through raids.
pt_pt: Outland Os jogadores com nível VIP 7+ que derrotem o Mestre da Outland podem abrir baús de Outland nos raides.

source: Mail Update The contents of the message and its expiration date are now displayed in the mail list. Important messages are highlighted.
pt_pt: Atualização de Correio Os conteúdos da mensagem e a sua expiração são apresentados na lista de correio, e as mais importantes são destacadas.

source: On top of that, you can now view all rewards at once when claiming your rewards through "Collect all."
pt_pt: Podes ver todas as recompensas ao mesmo tempo ao obtê-las através da opção "Obter todas."

source: Begin Today
pt_pt: Começa hoje

source: Open desktop version
pt_pt: Abrir a versão para ambiente de trabalho

source: TO DEFEAT THE ORC
pt_pt: PARA DERROTAR O ORC

source: Come join the fun!
pt_pt: Junta-te à festa!

source: Test your strength against the Archdemon and grab the new Stellar Skins along with a Skin+ for Iris!
pt_pt: Mostra o que vales contra o Archdemon e não percas os novos visuais Estelares e um Visual+ para Iris!

source: Arcane Knowledge!
pt_pt: Saber Arcano!

source: New looks are here, along with a Superskin for Lars!
pt_pt: Chegaram mais estilos e um Supervisual para Lars!

source: We’re working hard on the new update, and it’s coming sometime soon :) Follow us on Facebook to be the first to know about the release: facebook.com/IslandQuestaway
pt_pt: Estamos a trabalhar arduamente na nova atualização que vai ser lançada em breve :) Segue-nos no Facebook para saberes em primeira mão do seu lançamento: facebook.com/IslandQuestaway

source: Solaris has come to the Dominion to show the Titans the sun shines for sake her alone!
pt_pt: Solaris chegou ao Domínio para mostrar aos Titãs que o sol não brilha para todos!

source: Her skills can turn the tide of any battle, whether you need her to defend her allies, unleash a powerful attack on her enemies, or weaken them.
pt_pt: Quer precises de defender os teus aliados, devastar ou enfraquecer os teus inimigos, as poderosas habilidades de Solaris vão ajudar-te.

source: Join this special event to try Solaris in Brawls and make your team even more powerful with your new acquisition!
pt_pt: Participa neste evento especial, testa Solaris em combate e fortalece ainda mais a tua equipa!

source: DEFEAT THE CHEATER AND GROW YOUR TOWER
pt_pt: DERROTA O TRAIDOR E FAZ CRESCER A TUA TORRE

source: One of the figurines is hidden outside the deck.
pt_pt: Uma das figuras está escondida do lado de fora da plataforma.

source: Look for a big chest while exploring all available paths on the location :) Good luck!
pt_pt: Procura uma arca grande durante a exploração de todos os percursos disponíveis neste local :) Boa sorte!

source: Swiss Franc
pt_pt: Franco suíço

source: May Titan Brawls
pt_pt: Briga de Titãs de Maio

source: Participate in the mysterious adventure!
pt_pt: Junta-te a uma aventura misteriosa!

source: Cookie Disclaimer
pt_pt: Isenção de responsabilidade relativa a cookies

source: Stock up on resources and try out new Skins!
pt_pt: Obtém recursos e experimenta novos visuais!

source: Change
pt_pt: Alterar
